sd2-dsi-fceia/SD2_MCXC444_FXLS8964_driver/source/fxls8964.c
#include "fxls8964.h"
#include "fsl_i2c.h"
#include "fsl_port.h"
#include "fsl_gpio.h"
#include "fsl_clock.h"

#define FXLS8964_I2C_ADDRESS 0x18

#define INT1_PORT       PORTD
#define INT1_PORT_CLOCK kCLOCK_PortD
#define INT1_GPIO       GPIOD
#define INT1_PIN        1

#define FXLS8964_INT_STATUS_REG       0x00  // Interrupt and system status event flags
#define FXLS8964_TEMP_OUT_REG         0x01  // Temperature output data
#define FXLS8964_VECM_LSB_REG         0x02  // Vector magnitude LSB (12-bit vector magnitude)
#define FXLS8964_VECM_MSB_REG         0x03  // Vector magnitude MSB (12-bit vector magnitude)
#define FXLS8964_OUT_X_LSB_REG        0x04  // X-axis data LSB (or part, depending on endian)
#define FXLS8964_OUT_X_MSB_REG        0x05  // X-axis data MSB (or part)
#define FXLS8964_OUT_Y_LSB_REG        0x06  // Y-axis data LSB (or part)
#define FXLS8964_OUT_Y_MSB_REG        0x07  // Y-axis data MSB (or part)
#define FXLS8964_OUT_Z_LSB_REG        0x08  // Z-axis data LSB (or part)
#define FXLS8964_OUT_Z_MSB_REG        0x09  // Z-axis data MSB (or part)

#define FXLS8964_BUF_STATUS_REG       0x0B  // Buffer watermark/overflow status, sample count
#define FXLS8964_BUF_X_LSB_REG        0x0C  // Buffer X LSB (or part)
#define FXLS8964_BUF_X_MSB_REG        0x0D  // Buffer X MSB (or part)
#define FXLS8964_BUF_Y_LSB_REG        0x0E  // Buffer Y LSB (or part)
#define FXLS8964_BUF_Y_MSB_REG        0x0F  // Buffer Y MSB (or part)
#define FXLS8964_BUF_Z_LSB_REG        0x10  // Buffer Z LSB (or part)
#define FXLS8964_BUF_Z_MSB_REG        0x11  // Buffer Z MSB (or part)

#define FXLS8964_PROD_REV_REG         0x12  // Product revision (BCD)
#define FXLS8964_WHO_AM_I_REG         0x13  // Device ID (should read 0x84)

#define FXLS8964_SYS_MODE_REG         0x14  // System mode, buffer gate error flag/count

#define FXLS8964_SENS_CONFIG1_REG     0x15  // Full-scale, self-test, soft reset, Active enable
#define FXLS8964_SENS_CONFIG2_REG     0x16  // Wake/Sleep power modes, endian, auto-increment, fast-read
#define FXLS8964_SENS_CONFIG3_REG     0x17  // Wake/Sleep ODR and decimation selections
#define FXLS8964_SENS_CONFIG4_REG     0x18  // Auto-WAKE/SLEEP interrupt source enables, interrupt pin logic, ext trigger
#define FXLS8964_SENS_CONFIG5_REG     0x19  // Auto-increment disable bits for X/Y/Z, vector en, Hibernate enable

#define FXLS8964_WAKE_IDLE_LSB_REG    0x1A  // WAKE mode idle time LSB (12-bit)
#define FXLS8964_WAKE_IDLE_MSB_REG    0x1B  // WAKE mode idle time MSB (12-bit)
#define FXLS8964_SLEEP_IDLE_LSB_REG   0x1C  // SLEEP mode idle time LSB (12-bit)
#define FXLS8964_SLEEP_IDLE_MSB_REG   0x1D  // SLEEP mode idle time MSB (12-bit)
#define FXLS8964_ASLP_COUNT_LSB_REG   0x1E  // Auto-SLEEP inactivity timeout LSB (12-bit)
#define FXLS8964_ASLP_COUNT_MSB_REG   0x1F  // Auto-SLEEP inactivity timeout MSB (12-bit)

#define FXLS8964_INT_EN_REG           0x20  // Interrupt enable register
#define FXLS8964_INT_PIN_SEL_REG      0x21  // Interrupt routing (INT1/INT2)

#define FXLS8964_OFF_X_REG            0x22  // X-axis zero-g offset
#define FXLS8964_OFF_Y_REG            0x23  // Y-axis zero-g offset
#define FXLS8964_OFF_Z_REG            0x24  // Z-axis zero-g offset

#define FXLS8964_BUF_CONFIG1_REG      0x26  // Buffer operating mode, trigger source, data collection mode
#define FXLS8964_BUF_CONFIG2_REG      0x27  // Buffer flush, gate control, watermark level

#define FXLS8964_ORIENT_STATUS_REG    0x28  // Orientation event status
#define FXLS8964_ORIENT_CONFIG_REG    0x29  // Orientation detection configuration
#define FXLS8964_ORIENT_DBCOUNT_REG   0x2A  // Orientation debounce count
#define FXLS8964_ORIENT_BF_ZCOMP_REG  0x2B  // Orientation back/front Z-compensation
#define FXLS8964_ORIENT_THS_REG       0x2C  // Orientation threshold & hysteresis

#define FXLS8964_SDCD_INT_SRC1_REG    0x2D  // Sensor Data Change Detection OUT-OF-THRESH flags
#define FXLS8964_SDCD_INT_SRC2_REG    0x2E  // Sensor Data Change Detection WITHIN-THRESH flags
#define FXLS8964_SDCD_CONFIG1_REG     0x2F  // SDCD configuration 1 (axis enables, latch)
#define FXLS8964_SDCD_CONFIG2_REG     0x30  // SDCD configuration 2 (enable, ref update, mode, debounce)
#define FXLS8964_SDCD_OT_DBCNT_REG    0x31  // SDCD outside-threshold debounce count
#define FXLS8964_SDCD_WT_DBCNT_REG    0x32  // SDCD within-threshold debounce count
#define FXLS8964_SDCD_LTHS_LSB_REG    0x33  // SDCD lower-threshold LSB (12-bit)
#define FXLS8964_SDCD_LTHS_MSB_REG    0x34  // SDCD lower-threshold MSB (12-bit)
#define FXLS8964_SDCD_UTHS_LSB_REG    0x35  // SDCD upper-threshold LSB (12-bit)
#define FXLS8964_SDCD_UTHS_MSB_REG    0x36  // SDCD upper-threshold MSB (12-bit)

#define FXLS8964_SELF_TEST_CONFIG1_REG 0x37 // Self-test idle duration
#define FXLS8964_SELF_TEST_CONFIG2_REG 0x38 // Self-test measurement decimation

typedef union {
    struct {
        unsigned SRC_BOOT   : 1;  // bit 0
        unsigned SRC_ASLP   : 1;  // bit 1 Auto-WAKE/SLEEP event flag
        unsigned SRC_ORIENT : 1;  // bit 2 Orientation event flag
        unsigned SRC_SDCD_WT: 1;  // bit 3 SDCD within-threshold event flag
        unsigned SRC_SDCD_OT: 1;  // bit 4 SDCD outside-threshold event flag
        unsigned SRC_BUF    : 1;  // bit 5 Buffer event flag (SRC_BUF as per datasheet)
        unsigned SRC_OVF    : 1;  // bit 6 Output data overflow event flag
        unsigned SRC_DRDY   : 1;  // bit 7 Data-ready event flag
    } bits;
    uint8_t data;
} INT_STATUS_t;

typedef union {
    struct {
        unsigned BUF_CNT : 6;  // bits 0–5: sample count
        unsigned BUF_OVF : 1;  // bit 6: overflow flag
        unsigned BUF_WMRK: 1;  // bit 7: watermark event flag
    } bits;
    uint8_t data;
} BUF_STATUS_t;

typedef union {
    struct {
        unsigned SYS_MODE     : 2;  // bit 0-1: system operating mode
        unsigned BUF_GATE_CNT : 5;  // bit 2-6: number of OOR periods that have elapsed since the BUF _GATE_ERR flag was asserted
        unsigned BUF_GATE_ERR : 1;  // bit 7: buffer gate error flag
    } bits;
    uint8_t data;
} SYS_MODE_t;

