sd2-dsi-fceia/SD2_MCXC444_FXLS8964_driver/source/fxls8964.c
typedef union {
    struct {
        unsigned ACTIVE      : 1;  // bit 0: standby/active mode selection
        unsigned FSR         : 2;  // bit 1-2: full-scale measurement range
        unsigned SPI_M       : 1;  // bits 3: SPI interface mode selection
        unsigned ST_POL      : 1;  // bit 4: self-test displacement polarity
        unsigned ST_AXIS_SEL : 2;  // bits 5-6: selft-test axis selection
        unsigned RST         : 1;  // bit 7: soft reset
    } bits;
    uint8_t data;
} SENS_CONFIG1_t;

typedef union {
    struct {
    	unsigned F_READ     : 1;  // bit 0: fast-read mode
        unsigned AINC_TEMP  : 1;  // bit 1: Auto-increment temperature enable
        unsigned            : 1;  // bit 2: Reserved
        unsigned LE_BE      : 1;  // bit 3: endian selection
        unsigned SLEEP_PM   : 2;  // bits 4-5: sleep power mode selection
        unsigned WAKE_PM    : 2;  // bits 6-7: wake power mode selection
    } bits;
    uint8_t data;
} SENS_CONFIG2_t;

typedef union {
    struct {
        unsigned SLEEP_ODR : 4;  // bit 0-3: output data rate in sleep mode
        unsigned WAKE_ODR  : 4;  // bit 4-7: output data rate in sleep mode
    } bits;
    uint8_t data;
} SENS_CONFIG3_t;

typedef union {
    struct {
    	unsigned INT_POL      : 1;  // bit 0: interrupt logic polarity
        unsigned INT_PP_OD    : 1;  // bit 1: interrupt pins output driver selection
        unsigned INT2_FUNC    : 1;  // bit 2: INT2/EXT_TRG pin function selection
        unsigned DRDY_PUL     : 1;  // bit 3: pulse generation option for DRDY event
        unsigned WAKE_ORIENT  : 1;  // bit 4: orientation change event Auto-WAKE/SLEEP transition source enable
        unsigned WAKE_SDCD_OT : 1;  // bit 5: SDCD outside of thresholds event Auto-WAKE/SLEEP transition source enable
        unsigned WAKE_SDCD_WT : 1;  // bit 6: SDCD within thresholds event Auto-WAKE/SLEEP transition source enable
        unsigned EXT_TRG_M    : 1;  // bit 7: external trigger function acquisition mode
    } bits;
    uint8_t data;
} SENS_CONFIG4_t;

typedef union {
    struct {
        unsigned HIBERNATE_EN : 1;  // bit 0: Hibernate enable
        unsigned Z_DIS        : 1;  // bit 1: Z-axis auto-increment disable
        unsigned Y_DIS        : 1;  // bit 2: Y-axis auto-increment disable
        unsigned X_DIS        : 1;  // bit 3: X-axis auto-increment disable
        unsigned VECM_EN      : 1;  // bit 4: enable vector magnitude calculation
        unsigned RESERVED     : 3;  // bits 5-7
    } bits;
    uint8_t data;
} SENS_CONFIG5_t;

typedef union {
    struct {
        unsigned WAKE_OUT_EN : 1;  // bit 0: WAKE power state output enable
        unsigned BOOT_DIS    : 1;  // bit 1: Boot interrupt output disable
        unsigned ASLP_EN     : 1;  // bit 2: Auto-WAKE/SLEEP interrupt output enable
        unsigned ORIENT_EN   : 1;  // bit 3: Orientation interrupt output enable
        unsigned SDCD_WT_EN  : 1;  // bit 4: SDCD within thresholds interrupt output enable
        unsigned SDCD_OT_EN  : 1;  // bit 5: SDCD outside of thresholds interrupt output enable
        unsigned BUF_EN      : 1;  // bit 6: Output data buffer interrupt output enable
        unsigned DRDY_EN     : 1;  // bit 7: Data-ready interrupt output enable
    } bits;
    uint8_t data;
} INT_EN_t;

typedef union {
    struct {
        unsigned WAKE_OUT_INT2   : 1;  // bit 0: WAKE power state interrupt routing
        unsigned BOOT_INT2       : 1;  // bit 1: BOOT event interrupt routing
        unsigned ASLP_INT2       : 1;  // bit 2: Auto-WAKE/SLEEP event interrupt routing
        unsigned ORIENT_INT2     : 1;  // bit 3: ORIENT event interrupt routing
        unsigned SDCD_WT_INT2    : 1;  // bit 4: SDCD within thresholds event interrupt routing
        unsigned SDCD_OT_INT2    : 1;  // bit 5: SDCD outside of thresholds event interrupt routing
        unsigned BUF_INT2        : 1;  // bit 6: Output buffer interrupt routing
        unsigned DRDY_INT2       : 1;  // bit 7: Data-ready interrupt routing
    } bits;
    uint8_t data;
} INT_PIN_SEL_t;

typedef union {
    struct {
        unsigned TRIG_ORIENT   : 1;  // bit 0: Orientation change event buffer trigger enable
        unsigned               : 1;  // bit 1
        unsigned TRIG_SDCD_OT  : 1;  // bit 2: SDCD outside of thresholds event buffer trigger enable
        unsigned TRIG_SDCD_WT  : 1;  // bit 3: SDCD within thresholds event buffer trigger enable
        unsigned BUF_GATE      : 1;  // bit 4: Output data buffer gate enable
        unsigned BUF_MODE      : 2;  // bits 5-6: Output data buffer gate enable
        unsigned BUF_TYPE      : 1;  // bit 7: Buffer data read out order
    } bits;
    uint8_t data;
} BUF_CONFIG1_t;

typedef union {
    struct {
        unsigned BUF_WMRK     : 6;  // bits 0–5: Buffer sample count watermark
        unsigned WAKE_SRC_BUF : 1;  // bit 6: Buffer WAKE-to-SLEEP transition source enable
        unsigned BUF_FLUSH    : 1;  // bit 7: buffer flush enable
    } bits;
    uint8_t data;
} BUF_CONFIG2_t;

typedef union {
    struct {
        unsigned BAFRO      : 1;  // bit 0: Back or front orientation
        unsigned LAPO       : 2;  // bits 1-2: Landscape/Portrait orientation
        unsigned            : 3;  // bits 3-5
        unsigned LO         : 1;  // bit 6: Z-tilt angle lockout
        unsigned NEW_ORIENT : 1;  // bit 7: Orientation status change flag
    } bits;
    uint8_t data;
} ORIENT_STATUS_t;

typedef union {
    struct {
    	unsigned               : 6;  // bits 0-5
        unsigned ORIENT_ENABLE : 1;  // bit 6: orientation detection function enable
        unsigned ORIENT_DBCNTM : 3;  // bit 7: orientation debounce counter mode selection
    } bits;
    uint8_t data;
} ORIENT_CONFIG_t;

typedef union {
    struct {
        unsigned ORIENT_ZLOCK : 3;  // bits 0-2: Z-lockout angle threshold
        unsigned              : 3;  // bits 3-5
        unsigned ORIENT_BKFR  : 3;  // bits 6-7: Back-up/Front-up trip angle threshold
    } bits;
    uint8_t data;
} ORIENT_BF_ZCOMP_t;

