sd2-dsi-fceia/SD2_MCXC444_FXLS8964_driver/source/fxls8964.c
typedef union {
    struct {
        unsigned HYST    : 4;  // bit 0–3: hysteresis angle
        unsigned THRESH  : 4;  // bit 4–7: threshold angle
    } bits;
    uint8_t data;
} ORIENT_THS_t;

typedef union {
    struct {
    	unsigned Z_OT_POL : 1;  // bit 0: Z-axis outside-of-thresholds polarity flag
    	unsigned Z_OT_EF  : 1;  // bit 1: Z-axis data or delta-outside-of-upper-and-lower-thresholds event flag
    	unsigned Y_OT_POL : 1;  // bit 2: Y-axis outside-of-thresholds polarity flag
    	unsigned Y_OT_EF  : 1;  // bit 3: Y-axis data or delta-outside-of-upper-and-lower-thresholds event flag
    	unsigned X_OT_POL : 1;  // bit 4: X-axis outside-of-thresholds polarity flag
    	unsigned X_OT_EF  : 1;  // bit 5: X-axis data or delta-outside-of-upper-and-lower-thresholds event flag
        unsigned          : 1;  // bit 6
        unsigned OT_EA    : 1;  // bit 7: SDCD outside-of-thresholds event active flag
    } bits;
    uint8_t data;
} SDCD_INT_SRC1_t;

typedef union {
    struct {
    	unsigned         : 1;  // bit 0
        unsigned Z_WT_EF : 1;  // bit 1: Z-axis data or delta inside of upper and lower thresholds event flag
        unsigned         : 1;  // bit 2
		unsigned Y_WT_EF : 1;  // bit 3: Y-axis data or delta inside of upper and lower thresholds event flag
		unsigned         : 1;  // bit 4
		unsigned X_WT_EF : 1;  // bit 5: X-axis data or delta inside of upper and lower thresholds event flag
		unsigned         : 1;  // bit 6
		unsigned WT_EA   : 1;  // bit 7: SDCD within-thresholds event active flag
    } bits;
    uint8_t data;
} SDCD_INT_SRC2_t;

typedef union {
    struct {
        unsigned Z_WT_EN : 1;  // bit 0: SDCD function Z-axis within-thresholds condition
        unsigned Y_WT_EN : 1;  // bit 1: SDCD function Y-axis within-thresholds condition
        unsigned X_WT_EN : 1;  // bit 2: SDCD function X-axis within-thresholds condition
        unsigned Z_OT_EN : 1;  // bit 3: SDCD function Z-axis outside-of-thresholds condition
        unsigned Y_OT_EN : 1;  // bit 4: SDCD function Y-axis outside-of-thresholds condition
        unsigned X_OT_EN : 1;  // bit 5: SDCD function X-axis outside-of-thresholds condition
        unsigned WT_ELE  : 1;  // bit 6: SDCD within-thresholds event latch
        unsigned OT_ELE  : 1;  // bit 7: SDCD outside-of-thresholds event latch
    } bits;
    uint8_t data;
} SDCD_CONFIG1_t;

typedef union {
    struct {
        unsigned REF_UPD    : 1;  // bit 0: SDCD synchronous X/Y/Z reference values update bit
        unsigned MODE       : 1;  // bit 1: SDCD input data mode
        unsigned WT_LOG_SEL : 1;  // bit 2: SDCD within-thresholds event logic selection
        unsigned WT_DBCTM   : 1;  // bit 3: SDCD within-thresholds event debounce counter behavior
        unsigned OT_DBCTM   : 1;  // bit 4: SDCD outside-of-threshold event debounce counter behavior
        unsigned REF_UPDM   : 2;  // bits 5-6: SDCD internal reference values update mode
        unsigned SDCD_EN    : 1;  // bit 7: SDCD function
    } bits;
    uint8_t data;
} SDCD_CONFIG2_t;

/*==================[internal data declaration]==============================*/

static int16_t readX, readY, readZ;
static volatile bool booted = false;
static bool freeFallFlag = false;

/*==================[internal functions declaration]=========================*/
static uint8_t fxls8964_read_reg(uint8_t addr)
{
	i2c_master_transfer_t masterXfer;
    uint8_t ret;

	memset(&masterXfer, 0, sizeof(masterXfer));
	masterXfer.slaveAddress = FXLS8964_I2C_ADDRESS;
	masterXfer.direction = kI2C_Read;
	masterXfer.subaddress = addr;
	masterXfer.subaddressSize = 1;
	masterXfer.data = &ret;
	masterXfer.dataSize = 1;
	masterXfer.flags = kI2C_TransferDefaultFlag;

	I2C_MasterTransferBlocking(FXLS8964_I2C, &masterXfer);

	return ret;
}

static void fxls8964_write_reg(uint8_t addr, uint8_t data)
{
	i2c_master_transfer_t masterXfer;

    memset(&masterXfer, 0, sizeof(masterXfer));

    masterXfer.slaveAddress = FXLS8964_I2C_ADDRESS;
	masterXfer.direction = kI2C_Write;
	masterXfer.subaddress = addr;
	masterXfer.subaddressSize = 1;
	masterXfer.data = &data;
	masterXfer.dataSize = 1;
	masterXfer.flags = kI2C_TransferDefaultFlag;

    I2C_MasterTransferBlocking(FXLS8964_I2C, &masterXfer);
}

/*==================[internal data definition]===============================*/

/*==================[external data definition]===============================*/

/*==================[internal functions definition]==========================*/

static void config_port_int1(void)
{
	// Habilitación de clock
	CLOCK_EnableClock(INT1_PORT_CLOCK);

	const port_pin_config_t port_int1_config = {
			/* Internal pull-up/down resistor is disabled */
		.pullSelect = kPORT_PullDisable,
		/* Slow slew rate is configured */
		.slewRate = kPORT_SlowSlewRate,
		/* Passive filter is disabled */
		.passiveFilterEnable = kPORT_PassiveFilterDisable,
		/* Low drive strength is configured */
		.driveStrength = kPORT_LowDriveStrength,
		/* Pin is configured as GPIO */
		.mux = kPORT_MuxAsGpio,
	};
	const gpio_pin_config_t gpio_int1_config = {
		.pinDirection = kGPIO_DigitalInput,
		.outputLogic = 0U
	};

	PORT_SetPinConfig(INT1_PORT, INT1_PIN, &port_int1_config);
	GPIO_PinInit(INT1_GPIO, INT1_PIN, &gpio_int1_config);

	/* Interrupt polarity active high, or active low. Default value: 1.
	   0: Active low; 1: Active high. */
	PORT_SetPinInterruptConfig(INT1_PORT, INT1_PIN, kPORT_InterruptLogicOne);

	NVIC_EnableIRQ(PORTC_PORTD_IRQn);
	NVIC_SetPriority(PORTC_PORTD_IRQn, 0);
}

/*==================[external functions definition]==========================*/

void fxls8964_init(void)
{
	SENS_CONFIG1_t sens_config_1_reg;
	SENS_CONFIG3_t sens_config_3_reg;
	SENS_CONFIG4_t sens_config_4_reg;
	INT_EN_t int_en_reg;
	INT_PIN_SEL_t int_pin_sel_reg;

	// GPIO INT1 config
	config_port_int1();

    // Software reset
    sens_config_1_reg.data = 0;
    sens_config_1_reg.bits.RST = 1;
    fxls8964_write_reg(FXLS8964_SENS_CONFIG1_REG, sens_config_1_reg.data);

    // Esperar a que se complete el reset
    while(!booted);

	// Salgo de modo active
	sens_config_1_reg.data = fxls8964_read_reg(FXLS8964_SENS_CONFIG1_REG);
	sens_config_1_reg.bits.ACTIVE = 0;
    fxls8964_write_reg(FXLS8964_SENS_CONFIG1_REG, sens_config_1_reg.data);

    // Config register 1
    sens_config_1_reg.data = 0;
    sens_config_1_reg.bits.FSR = 0b00; // +-2g full-scale
    fxls8964_write_reg(FXLS8964_SENS_CONFIG1_REG, sens_config_1_reg.data);

    // Config register 3
    sens_config_3_reg.data = 0;
    sens_config_3_reg.bits.WAKE_ODR = DR_50hz; // Wake up mode output data rate
    sens_config_3_reg.bits.SLEEP_ODR = DR_50hz; // Sleep mode output data rate
    fxls8964_write_reg(FXLS8964_SENS_CONFIG3_REG, sens_config_3_reg.data);

    // Config register 4
    sens_config_4_reg.data = 0;
    sens_config_4_reg.bits.DRDY_PUL = 0;  // Interrupciones por DRDY active high/low (no pulsos)
    sens_config_4_reg.bits.INT_POL = 1;   // Interrupciones active high
    sens_config_4_reg.bits.INT_PP_OD = 0; // Pines de interrupción push-pull
    fxls8964_write_reg(FXLS8964_SENS_CONFIG4_REG, sens_config_4_reg.data);

    // Data ready interrupt enable and boot interrupt disable
    int_en_reg.data = 0;
    int_en_reg.bits.DRDY_EN = 1;
    int_en_reg.bits.BOOT_DIS = 1;
	fxls8964_write_reg(FXLS8964_INT_EN_REG, int_en_reg.data);

