sd2-dsi-fceia/SD2_MCXC444_FXLS8964_driver/source/fxls8964.c
bool fxls8964_getFreeFall(void)
{
	bool ret = false;

	if(freeFallFlag)
	{
		freeFallFlag = false;
		ret = true;
	}

	return ret;
}

int16_t fxls8964_getAcX(void)
{
	return (int16_t)(((int32_t)readX * 100 * 4) / (int32_t)4096);
}

int16_t fxls8964_getAcY(void)
{
	return (int16_t)(((int32_t)readY * 100 * 4) / (int32_t)4096);
}

int16_t fxls8964_getAcZ(void)
{
	return (int16_t)(((int32_t)readZ * 100 * 4) / (int32_t)4096);
}

void PORTC_PORTD_IRQHandler(void)
{
    int16_t readG;
    INT_STATUS_t intStatus;
    SDCD_INT_SRC2_t sdcdIntSrc;
    uint32_t time_us;
    uint8_t reg;

    intStatus.data = fxls8964_read_reg(FXLS8964_INT_STATUS_REG);

    if (intStatus.bits.SRC_DRDY)
    {
        // Se lee eje X
		reg = fxls8964_read_reg(FXLS8964_OUT_X_MSB_REG);
		readG   = (int16_t)reg<<8;
		reg = fxls8964_read_reg(FXLS8964_OUT_X_LSB_REG);
		readG  |= reg;
		readX = readG;

		// Se lee eje Y
		reg = fxls8964_read_reg(FXLS8964_OUT_Y_MSB_REG);
		readG   = (int16_t)reg<<8;
		reg = fxls8964_read_reg(FXLS8964_OUT_Y_MSB_REG);
		readG  |= reg;
		readY = readG;

        // Se lee eje Z
		reg = fxls8964_read_reg(FXLS8964_OUT_Z_MSB_REG);
		readG   = (int16_t)reg<<8;
		reg = fxls8964_read_reg(FXLS8964_OUT_Z_MSB_REG);
		readG  |= reg;
		readZ = readG;
    }
    else if(intStatus.bits.SRC_BOOT)
    {
    	booted = true;
    }
    else if(intStatus.bits.SRC_SDCD_WT)
    {
    	sdcdIntSrc.data = fxls8964_read_reg(FXLS8964_SDCD_INT_SRC2_REG);

    	if(sdcdIntSrc.bits.WT_EA)
    	{
        	freeFallFlag = true;
    	}
    }

    PORT_ClearPinsInterruptFlags(INT1_PORT, 1 << INT1_PIN);
}

/*==================[end of file]============================================*/
